In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#pd.FUNCTIONS
#pd.DATA_STRUCTURES

In [3]:
Series

pandas.core.series.Series

In [4]:
nums = [100, 200, 300]
nums

[100, 200, 300]

In [5]:
Series(nums)

0    100
1    200
2    300
dtype: int64

In [6]:
d = {"one":1, "two":2, "three":3}
d

{'one': 1, 'two': 2, 'three': 3}

In [7]:
s = Series(d)
s

one      1
two      2
three    3
dtype: int64

In [8]:
dict(s)

{'one': 1, 'two': 2, 'three': 3}

In [9]:
s["two"]

2

In [10]:
s

one      1
two      2
three    3
dtype: int64

In [11]:
s[1:]

two      2
three    3
dtype: int64

In [12]:
nums = Series([300,400,500])
nums

0    300
1    400
2    500
dtype: int64

In [13]:
nums[2]

500

In [14]:
nums[:-1]

0    300
1    400
dtype: int64

In [15]:
# does not work:
# nums[-1]

In [16]:
s = Series({-1:"negative", 0:"zero", 1:"positive"})
s

-1    negative
 0        zero
 1    positive
dtype: object

In [17]:
s[-1]

'negative'

In [18]:
s[-1:]

1    positive
dtype: object

In [19]:
s = Series(["A", "B", "C"])
s

0    A
1    B
2    C
dtype: object

In [20]:
s = Series({0:"A", 1:"B", 2:"C"})
s

0    A
1    B
2    C
dtype: object

In [21]:
# element-wise operations
# 1) Series OPERATION Series
# 2) Series OPERATION Scalar

In [22]:
[1, 2] + [3, 4]

[1, 2, 3, 4]

In [23]:
Series([1, 2]) + Series([3, 4])

0    4
1    6
dtype: int64

In [24]:
Series([1, 2]) + Series([3, 4, 5])

0    4.0
1    6.0
2    NaN
dtype: float64

In [25]:
Series([3, 4, 5]) + 100

0    103
1    104
2    105
dtype: int64

In [26]:
Series(["A", "B", "C"]) + "!!!!!"

0    A!!!!!
1    B!!!!!
2    C!!!!!
dtype: object

In [27]:
Series(["A", "B", "C"]) * 3

0    AAA
1    BBB
2    CCC
dtype: object

In [28]:
s[50] = "D"
s

0     A
1     B
2     C
50    D
dtype: object

In [29]:
# Boolean, element-wise

In [30]:
s1 = Series([3,4,5])
s1

0    3
1    4
2    5
dtype: int64

In [31]:
s2 = Series([5,4,3])
s2

0    5
1    4
2    3
dtype: int64

In [32]:
b = s1 > s2
b

0    False
1    False
2     True
dtype: bool

In [33]:
b1 = Series([False, False, True])
b1

0    False
1    False
2     True
dtype: bool

In [34]:
b2 = Series([False, True, True])
b2

0    False
1     True
2     True
dtype: bool

In [35]:
# cannot override and, or operators
# b1 and b2

In [36]:
# used & for and
b1 & b2

0    False
1    False
2     True
dtype: bool

In [37]:
# used | for or
b1 | b2

0    False
1     True
2     True
dtype: bool

In [38]:
b1

0    False
1    False
2     True
dtype: bool

In [39]:
b2

0    False
1     True
2     True
dtype: bool

In [40]:
b1 == b2

0     True
1    False
2     True
dtype: bool

In [41]:
# DATA ALIGNMENT

In [42]:
s1 = Series([7,8,9])
s1

0    7
1    8
2    9
dtype: int64

In [43]:
s2 = Series([100, 200, 300])
s3 = Series([100, 200, 300], index=[2,1,0])
s3

2    100
1    200
0    300
dtype: int64

In [44]:
s1 + s3

0    307
1    208
2    109
dtype: int64

In [45]:
s1 = Series([7,8,9])
s1

0    7
1    8
2    9
dtype: int64

In [46]:
s3 = Series([100, 200, 300], index=[3,2,1])
s3

3    100
2    200
1    300
dtype: int64

In [47]:
s1 + s3

0      NaN
1    308.0
2    209.0
3      NaN
dtype: float64

In [48]:
# FANCY INDEXING

# obj[X]
#
# 1. obj is a list and X is a integer
# 2. obj is a dict and X is a key
# 3. obj and X are both Series, and the X series contains booleans

In [49]:
s = Series(["A", "B", "C", "D"])
s

0    A
1    B
2    C
3    D
dtype: object

In [50]:
b = Series([True, False, False, True])
b

0     True
1    False
2    False
3     True
dtype: bool

In [51]:
s[b]

0    A
3    D
dtype: object

In [52]:
# combine: (1) element-wise bool operations, (2) fancy indexing

In [53]:
s = Series([10, 11, 21, 20, 9])
s

0    10
1    11
2    21
3    20
4     9
dtype: int64

In [54]:
# WANT: get all the numbers > 15
b = s > 15
b

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [55]:
s[b]

2    21
3    20
dtype: int64

In [56]:
s

0    10
1    11
2    21
3    20
4     9
dtype: int64

In [57]:
s[s > 15]

2    21
3    20
dtype: int64

In [58]:
s[s <= 15]

0    10
1    11
4     9
dtype: int64

In [59]:
s

0    10
1    11
2    21
3    20
4     9
dtype: int64

In [60]:
s[s % 2 == 1]

1    11
2    21
4     9
dtype: int64

In [61]:
s[s > 10]

1    11
2    21
3    20
dtype: int64

In [62]:
# WANT: odd numbers greater than 10
s[(s % 2 == 1) & (s > 10)]

1    11
2    21
dtype: int64

In [63]:
# and is low precedence, & is high precedence

In [64]:
# FAILs because it does the & first
# s[s % 2 == 1 & s > 10]

In [65]:
# WANT: get all the upper case values
s = Series(["apple", "BANANA", "dog", "CAT"])

In [66]:
s.str.upper()

0     APPLE
1    BANANA
2       DOG
3       CAT
dtype: object

In [67]:
s[s == s.str.upper()]

1    BANANA
3       CAT
dtype: object

In [70]:
# DataFrames = Tables
names = Series(["alice", "bob", "cindy"])
scores = Series([10, 20, 30])
names

0    alice
1      bob
2    cindy
dtype: object

In [71]:
scores

0    10
1    20
2    30
dtype: int64

In [69]:
DataFrame({"name": names, "user score": scores})

    name  user score
0  alice          10
1    bob          20
2  cindy          30

In [80]:
df = DataFrame({"name": ["alice", "bob", "cindy"],
                "user score": [10, 20, 30],
                 "where": [0,0,0]})
df

    name  user score  where
0  alice          10      0
1    bob          20      0
2  cindy          30      0

In [81]:
df == df

   name  user score  where
0  True        True   True
1  True        True   True
2  True        True   True

In [82]:
df["name"]

0    alice
1      bob
2    cindy
Name: name, dtype: object

In [83]:
df["user score"]

0    10
1    20
2    30
Name: user score, dtype: int64

In [84]:
df.name # shorthand for df["name"]

0    alice
1      bob
2    cindy
Name: name, dtype: object

In [85]:
df["where"]

0    0
1    0
2    0
Name: where, dtype: int64

In [86]:
df.where

<bound method NDFrame.where of     name  user score  where
0  alice          10      0
1    bob          20      0
2  cindy          30      0>

In [87]:
df

    name  user score  where
0  alice          10      0
1    bob          20      0
2  cindy          30      0

In [91]:
df.iloc[0]

name          alice
user score       10
where             0
Name: 0, dtype: object

In [93]:
df

    name  user score  where
0  alice          10      0
1    bob          20      0
2  cindy          30      0

In [97]:
new_df = df.set_index("name") # does not change df
new_df

       user score  where
name
alice          10      0
bob            20      0
cindy          30      0

In [100]:
new_df.loc["bob"]

user score    20
where          0
Name: bob, dtype: int64

In [105]:
new_df.iloc[-1]

user score    30
where          0
Name: cindy, dtype: int64

In [107]:
s = new_df["user score"]
s

name
alice    10
bob      20
cindy    30
Name: user score, dtype: int64

In [108]:
s.iloc[-1]

30

In [111]:
s["alice"] # think of this as usually a shorthand for s.loc["alice"]

10

In [112]:
s.loc["alice"]

10

In [118]:
new_df

       user score  where
name
alice          10      0
bob            20      0
cindy          30      0

In [117]:
new_df.loc["bob", "user score"]

20

In [119]:
new_df.iloc[1, 0]

20

In [120]:
new_df.loc["bob", "user score"] += 1

In [121]:
new_df

       user score  where
name
alice          10      0
bob            21      0
cindy          30      0

In [122]:
new_df.iloc[2, 0] += 1

In [123]:
new_df

       user score  where
name
alice          10      0
bob            21      0
cindy          31      0

In [126]:
new_df["another column"] = new_df["user score"] + 1

In [127]:
new_df

       user score  where  another column
name
alice          10      0              11
bob            21      0              22
cindy          31      0              32

In [130]:
df = pd.read_csv("Fifa18.csv")
df.head()

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
0,20801,Cristiano Ronaldo,32,Portugal,Real Madrid CF,Spanish Primera División,565000,95500000,94
1,158023,L. Messi,30,Argentina,FC Barcelona,Spanish Primera División,565000,105000000,93
2,190871,Neymar,25,Brazil,Paris Saint-Germain,French Ligue 1,280000,123000000,92
3,176580,L. Suárez,30,Uruguay,FC Barcelona,Spanish Primera División,510000,97000000,92
4,167495,M. Neuer,31,Germany,FC Bayern Munich,German Bundesliga,230000,61000000,92

In [131]:
df.euro_wage

0        565000
1        565000
2        280000
3        510000
4        230000
5        355000
6        215000
7        295000
8        340000
9        275000
10       310000
11       285000
12       190000
13       265000
14       340000
15       370000
16       325000
17       225000
18       110000
19       215000
20        82000
21       150000
22       225000
23       165000
24       210000
25       215000
26       125000
27       215000
28       265000
29       165000
          ...
17439      2000
17440      1000
17441      1000
17442      1000
17443      1000
17444      1000
17445      1000
17446      1000
17447      1000
17448      1000
17449      1000
17450      1000
17451      1000
17452      1000
17453      1000
17454      1000
17455      1000
17456      1000
17457      1000
17458      1000
17459      2000
17460      1000
17461      1000
17462      1000
17463      1000
17464      1000
17465      1000
17466      1000
17467      1000
17468      1000
Name: euro_wage, Length: 17469, dtype: int64

In [132]:
df.head()

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
0,20801,Cristiano Ronaldo,32,Portugal,Real Madrid CF,Spanish Primera División,565000,95500000,94
1,158023,L. Messi,30,Argentina,FC Barcelona,Spanish Primera División,565000,105000000,93
2,190871,Neymar,25,Brazil,Paris Saint-Germain,French Ligue 1,280000,123000000,92
3,176580,L. Suárez,30,Uruguay,FC Barcelona,Spanish Primera División,510000,97000000,92
4,167495,M. Neuer,31,Germany,FC Bayern Munich,German Bundesliga,230000,61000000,92

In [135]:
df["Age"].max()

47

In [ ]:
# Fancy Indexing:
# 1. Series[BoolSeries]
# 2. DataFrame[BoolSeries]

In [138]:
df[df["Age"] == df["Age"].max()]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
17465,11728,B. Richardson,47,England,Wycombe Wanderers,English League Two,1000,0,46

In [139]:
df[df["Age"] > 42]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
4685,140029,O. Pérez,44,Mexico,Pachuca,Mexican Liga MX,9000,160000,71
5149,188033,E. El Hadary,44,Egypt,Al Taawoun,Saudi Professional League,7000,120000,70
16276,53506,D. Coyne,43,Wales,Shrewsbury,English League One,1000,10000,55
16399,53643,J. Walker,43,England,Lincoln City,English League Two,1000,10000,55
17465,11728,B. Richardson,47,England,Wycombe Wanderers,English League Two,1000,0,46

In [142]:
stats = df.describe()
stats

                  Id           Age      euro_wage      networth  score_of_100
count   17469.000000  17469.000000   17469.000000  1.746900e+04  17469.000000
mean   207584.098460     25.133265   11696.433683  2.407283e+06     66.271395
std     32339.098668      4.597354   23249.349262  5.391004e+06      6.931154
min        16.000000     16.000000    1000.000000  0.000000e+00     46.000000
25%    192567.000000     21.000000    2000.000000  3.250000e+05     62.000000
50%    214016.000000     25.000000    4000.000000  7.000000e+05     66.000000
75%    231383.000000     28.000000   12000.000000  2.100000e+06     71.000000
max    241219.000000     47.000000  565000.000000  1.230000e+08     94.000000

In [144]:
stddev = stats.loc["std", "euro_wage"]
stddev

23249.349262210257

In [145]:
df[df.euro_wage > df.euro_wage.mean() + 3*stddev]

,Id,name,Age,nationality,club,league,euro_wage,networth,score_of_100
0,20801,Cristiano Ronaldo,32,Portugal,Real Madrid CF,Spanish Primera División,565000,95500000,94
1,158023,L. Messi,30,Argentina,FC Barcelona,Spanish Primera División,565000,105000000,93
2,190871,Neymar,25,Brazil,Paris Saint-Germain,French Ligue 1,280000,123000000,92
3,176580,L. Suárez,30,Uruguay,FC Barcelona,Spanish Primera División,510000,97000000,92
4,167495,M. Neuer,31,Germany,FC Bayern Munich,German Bundesliga,230000,61000000,92
5,188545,R. Lewandowski,28,Poland,FC Bayern Munich,German Bundesliga,355000,92000000,91
6,193080,De Gea,26,Spain,Manchester United,English Premier League,215000,64500000,90
7,183277,E. Hazard,26,Belgium,Chelsea,English Premier League,295000,90500000,90
8,182521,T. Kroos,27,Germany,Real Madrid CF,Spanish Primera División,340000,79000000,90
9,167664,G. Higuaín,29,Argentina,Juventus,Italian Serie A,275000,77000000,90
10,155862,Sergio Ramos,31,Spain,Real Madrid CF,Spanish Primera División,310000,52000000,90
11,192985,K. De Bruyne,26,Belgium,Manchester City,English Premier League,285000,83000000,89
12,192119,T. Courtois,25,Belgium,Chelsea,English Premier League,190000,59000000,89
13,184941,A. Sánchez,28,Chile,Arsenal,English Premier League,265000,67500000,89
14,177003,L. Modrić,31,Croatia,Real Madrid CF,Spanish Primera División,340000,57000000,89
15,173731,G. Bale,27,Wales,Real Madrid CF,Spanish Primera División,370000,69500000,89
16,153079,S. Agüero,29,Argentina,Manchester City,English Premier League,325000,66500000,89
17,138956,G. Chiellini,32,Italy,Juventus,Italian Serie A,225000,38000000,89
18,1179,G. Buffon,39,Italy,Juventus,Italian Serie A,110000,4500000,89
19,211110,P. Dybala,23,Argentina,Juventus,Italian Serie A,215000,79000000,88
20,200389,J. Oblak,24,Slovenia,Atlético Madrid,Spanish Primera División,82000,57000000,88
21,194765,A. Griezmann,26,France,Atlético Madrid,Spanish Primera División,150000,75000000,88
22,189509,Thiago,26,Spain,FC Bayern Munich,German Bundesliga,225000,70500000,88
23,188567,P. Aubameyang,28,Gabon,Borussia Dortmund,German Bundesliga,165000,61000000,88
24,184344,L. Bonucci,30,Italy,Milan,Italian Serie A,210000,44000000,88
25,183907,J. Boateng,28,Germany,FC Bayern Munich,German Bundesliga,215000,48000000,88
26,182493,D. Godín,31,Uruguay,Atlético Madrid,Spanish Primera División,125000,40000000,88
27,178603,M. Hummels,28,Germany,FC Bayern Munich,German Bundesliga,215000,48000000,88
28,176635,M. Özil,28,Germany,Arsenal,English Premier League,265000,60000000,88
29,167948,H. Lloris,30,France,Tottenham Hotspur,English Premier League,165000,38000000,88
...,...,...,...,...,...,...,...,...,...
918,208450,Andreas Pereira,21,Brazil,Valencia CF,Spanish Primera División,86000,14000000,77
927,192073,A. Bertolacci,26,Italy,Genoa,Italian Serie A,88000,11000000,77
934,191053,T. Rincón,29,Venezuela,Torino,Italian Serie A,97000,8500000,77
959,183394,M. Sissoko,27,France,Tottenham Hotspur,English Premier League,84000,9500000,77
974,226161,Marcos Llorente,22,Spain,Real Madrid CF,Spanish Primera División,105000,12000000,77
998,217731,Sandro,21,Spain,Everton,English Premier League,84000,13500000,77
999,183427,F. Delph,27,England,Manchester City,English Premier League,110000,10000000,77
1008,225161,Vallejo,20,Spain,Real Madrid CF,Spanish Primera División,90000,11500000,77
1040,158626,M. Debuchy,31,France,Arsenal,English Premier League,88000,6000000,77
1045,171688,Fábio Coentrão,29,Portugal,Sporting CP,Portuguese Primeira Liga,125000,6500000,77
1046,204713,J. Campbell,25,Costa Rica,Real Betis Balompié,Spanish Primera División,92000,11000000,77
1050,152747,A. Lennon,30,England,Everton,English Premier League,97000,8500000,77
1060,186801,C. Kouyaté,27,Senegal,West Ham United,English Premier League,83000,8500000,77
1116,199667,R. Funes Mori,26,Argentina,Everton,English Premier League,88000,9500000,77
1134,169216,S. Long,30,Republic of Ireland,Southampton,English Premier League,85000,7500000,76
1159,195859,D. Ings,24,England,Liverpool,English Premier League,92000,10000000,76
1183,223273,M. Pašalić,22,Croatia,Spartak Moscow,Russian Premier League,89000,11500000,76
1194,152879,M. Noble,30,England,West Ham United,English Premier League,83000,5500000,76
1280,19292,J. Collins,33,Wales,West Ham United,English Premier League,83000,3100000,76
1290,211302,G. Lapadula,27,Italy,Genoa,Italian Serie A,96000,9000000,76
1374,212125,L. Marković,23,Serbia,Liverpool,English Premier League,84000,10000000,76
1395,189615,A. Cresswell,27,England,West Ham United,English Premier League,83000,7000000,76
1447,229593,M. Pjaca,22,Croatia,Juventus,Italian Serie A,89000,12500000,76
1492,202493,Aleix Vidal,27,Spain,FC Barcelona,Spanish Primera División,120000,6500000,76
1527,193554,D. Sakho,27,Senegal,West Ham United,English Premier League,83000,8000000,75
1638,152908,A. Young,31,England,Manchester United,English Premier League,84000,4400000,75
1671,220253,Munir,21,Spain,Deportivo Alavés,Spanish Primera División,95000,9500000,75
1865,208339,O. Niasse,27,Senegal,Everton,English Premier League,88000,7000000,75
2784,211048,O. Kayode,24,Nigeria,Girona CF,Spanish Primera División,88000,5500000,73
3070,208088,Sergi Samper,22,Spain,UD Las Palmas,Spanish Primera División,85000,4800000,73

In [147]:
df.describe()

                  Id           Age      euro_wage      networth  score_of_100
count   17469.000000  17469.000000   17469.000000  1.746900e+04  17469.000000
mean   207584.098460     25.133265   11696.433683  2.407283e+06     66.271395
std     32339.098668      4.597354   23249.349262  5.391004e+06      6.931154
min        16.000000     16.000000    1000.000000  0.000000e+00     46.000000
25%    192567.000000     21.000000    2000.000000  3.250000e+05     62.000000
50%    214016.000000     25.000000    4000.000000  7.000000e+05     66.000000
75%    231383.000000     28.000000   12000.000000  2.100000e+06     71.000000
max    241219.000000     47.000000  565000.000000  1.230000e+08     94.000000